#1
a = float(input("Введіть своє перше число : "))
b = float(input("Введіть своє друге число : "))
c = float(input("Введіть своє третє число : "))
d = float(input("Введіть своє четверте число : "))
print( a + b / c ** d)
#1. Спочатку має виконатися возведення в степінь, тобто c**d
#2. Потім має виконатися дія ділення, змінна b поділити на результат першого пункту
#3. Потім має виконатися дія додавання, змінну а + результат другог пункту
#4. І в кінці ми можемо вивести наше число за допомогою функции print
#5 Висновок: на цій вправі я зміг визначити пріорітетність виконання та опрацювання,
# найпростіших математичних дій комп'ютером, а також познайомився з найпростішими
# функціями, які нам надає середовище python